# Завдання 2
# Знайти суму елементів із парними індексами
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
lst = [3,4,5]
i = 0
summ = 0
if bool(lst) == True:
    while i < len(lst):
        summ = summ + lst[i] 
        i=i+2
    summ = summ * lst[-1] 
print(summ)
#************************************

# Task 2. Version 2
summ = 0
if bool(lst) == True:
    for i in lst[::2]:
        summ += i
    summ = summ * lst[-1]
print(summ)